In [1]:
import pandas as pd
import numpy as np

In [6]:
df=pd.read_csv("../source_data\med-insurance.csv")

<>:1: SyntaxWarning: invalid escape sequence '\m'
<>:1: SyntaxWarning: invalid escape sequence '\m'
C:\Users\admin\AppData\Local\Temp\ipykernel_4364\689367208.py:1: SyntaxWarning: invalid escape sequence '\m'
  df=pd.read_csv("../source_data\med-insurance.csv")

In [7]:
df.smoker.replace(('yes','no'),(1,0),inplace=True)

C:\Users\admin\AppData\Local\Temp\ipykernel_4364\3730078447.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.smoker.replace(('yes','no'),(1,0),inplace=True)

In [8]:
df.head()

   age     sex   bmi  children  smoker     region  expenses
0   19  female  27.9         0       1  southwest  16884.92
1   18    male  33.8         1       0  southeast   1725.55
2   28    male  33.0         3       0  southeast   4449.46
3   33    male  22.7         0       0  northwest  21984.47
4   32    male  28.9         0       0  northwest   3866.86

In [11]:
df.sex.replace(('male','female'),(1,0),inplace=True)

C:\Users\admin\AppData\Local\Temp\ipykernel_4364\442692946.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.sex.replace(('male','female'),(1,0),inplace=True)

In [12]:
df.head()

   age  sex   bmi  children  smoker     region  expenses
0   19    0  27.9         0       1  southwest  16884.92
1   18    1  33.8         1       0  southeast   1725.55
2   28    1  33.0         3       0  southeast   4449.46
3   33    1  22.7         0       0  northwest  21984.47
4   32    1  28.9         0       0  northwest   3866.86

In [13]:
df['region']=[0 if i == "southwest" else
              1 if i == "northhwest" else
              2 if i == "southeast" else
              3 for i in df['region']]

In [14]:
df.tail()

      age  sex   bmi  children  smoker  region  expenses
1333   50    1  31.0         3       0       3  10600.55
1334   18    0  31.9         0       0       3   2205.98
1335   18    0  36.9         0       0       2   1629.83
1336   21    0  25.8         0       0       0   2007.95
1337   61    0  29.1         0       1       3  29141.36

In [15]:
df.head()

   age  sex   bmi  children  smoker  region  expenses
0   19    0  27.9         0       1       0  16884.92
1   18    1  33.8         1       0       2   1725.55
2   28    1  33.0         3       0       2   4449.46
3   33    1  22.7         0       0       3  21984.47
4   32    1  28.9         0       0       3   3866.86

In [16]:
df.to_csv("../data/raw/insurance.csv",mode="w",index=False)